---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DetailArc
source: html/8ca6a426-9d9c-91a1-7219-2e23bec71240.htm
---
# DetailArc Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.